artillery/tests/tomatometer-validate-only.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:8080/api
  phases:
    - duration: 60 # Seconds that this phase will last
      arrivalRate: 5 # 1 new virtual user per second
      rampTo: 10 # gradually ramp up to 5 new users per second
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 30
      arrivalRate: 100
      name: Spike phase
  payload:
    path: '../data/generated_users.csv'
    fields:
      - userId
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    apdex:
      threshold: 300
    metrics-by-endpoint: {}
    fake-data: {}
scenarios:
  - flow:
      - loop:
          - post:
              url: '/pomodoro/session'
              headers:
                Content-Type: application/json
                user-id: '{{ userId }}'
              json:
                duration: 25
                productivity: 3              
        count: 10